---
kind: enumMember
id: F:Autodesk.Revit.DB.WallCrossSection.SingleSlanted
enum: Autodesk.Revit.DB.WallCrossSection
source: html/c0017a61-ed27-8124-f3f7-17d73c446169.htm
---
# Autodesk.Revit.DB.WallCrossSection.SingleSlanted

A single-slanted wall whose angle is controlled by the parameter WALL_SINGLE_SLANT_ANGLE_FROM_VERTICAL.